[
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Development Engineering",
        "details": "I visited their booth at my University's career fair and then got an on-campus interview about 1 and a half months later. The on-campus interview was a short 30 minute interview where I got asked questions about linked lists: How would you determine if there is a cycle in a linked list? How would you find the head of the cycle i.e. where the cycle starts? How would you find the kth element from the end of a linked list? Then about 2 weeks later I got an invitation for interviews on-site and about 3 weeks after that I flew out to Redmond. I had 4 interviews on-site which had behavioral questions and also coding questions like: How would you test a phone (your simple 20 year old phone)? Give test cases for some functions whose implementation is not know i.e. blackbox testing. The people there were great and I really liked their campus.",
        "questions": [
            "Given a linked list with three fields: a data field, a next field and a random pointer field (which is a field that points to null or to an element in the linked list) write a function to return a copy of the linked list without destructively modifying the original linked list   6 Answers"
        ],
        "date": "Dec 18, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "3 weeks",
        "role": "Software Development Engineer",
        "details": "I was messaged by Microsoft recruiters from Linkedin. They sent me an online assesment which you have to complete in 60 minutes. If you pass that you will be able to go on-site. I interviewed at Microsoft on campus in Redmond for a full day loop of 6 people. Everyone was super friendly and super excited about future of Microsoft under new CEO leadership.",
        "questions": [
            "Signed NDA Contract. Algorithmic and Design Architecture Problems. They drill you deep on multi threading and distributed systems.   3 Answers"
        ],
        "date": "Mar 3, 2017"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Development Engineer",
        "details": "I got referred to a specific team at Microsoft as New Grad hiring was halted for 2016. Talked to a manager on the phone for an hour, and was asked about my resume and did a interview question. Was flown to Seattle 2 weeks later and had an onsite interview with the team at Redmond. It consisted of 5 interviews with coding and culture-fit questions. I was at the Microsoft Campus from 9AM to 4:30PM. The process was nice, and the interviews were more conversational than say Google onsite interviews. I got a call 2 days later with an offer to join the team.Microsoft enjoyed asking data structure questions with arrays, linked lists, strings, etc. Questions on graphs are said to be rare. Be prepared to answer any design questions, which may be follow up questions to coding questions.",
        "questions": [
            "Questions on string traversal, arrays + math were common in my interview.   4 Answers"
        ],
        "date": "Apr 5, 2017"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "4 on-site interviews over a day with lunch in the middle. Each interviewer explained what they did, what the context of the question was, and the rest of the interview was spent solving the technical question. All four interviewers asked a question from a different domain.",
        "questions": [
            "Create an algorithm to reverse a string in-place.   2 Answers"
        ],
        "date": "Apr 21, 2017"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "-",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "I was contacted by the recruiter for the SDE position for their hiring event. I was asked to register and will get the Online test in a week. It's been more than a month since than. I tried to reach the recruiter many times but won't respond back. Any other recruiters won't accept my application since I was contacted previously by other recruiter. I don't understand whether they really are looking for engineers or an applicant just suffers because of all this inside conflicts. It's not believable from such a good company.",
        "questions": [
            "Why Microsoft?   3 Answers"
        ],
        "date": "Apr 17, 2017"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Development Engineer",
        "details": "I applied and got an on-campus interview because of a connection with Campus Recruitment.The interview was quick, with a coding question, some resume review, and a question about explaining and making a simple diagram of a previous project. Not a very personal experience, and I likely did not stand out enough as a confident candidate.",
        "questions": [
            "Given the head of a linked list, write a program in your language of choice to return the middle node of the list.   7 Answers"
        ],
        "date": "Feb 9, 2017"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Software Development Engineer",
        "details": "Had a referral sent in by a friend and had a phone screen with the manager (mostly questions about the team and my past experience, followed by a quick coding question). Followed by about a month of inactivity and then was brought in to an onsite with 4 people (3 engineers, 1 manager) and a lunch at the cafeteria. Each round involved talking about personal projects and experience, followed by a technical question and a demo of the team's product in several cases. Surprised by a 5th interviewer pop up at the end who seemed unaware of me and was on his phone and walked off in the middle to get tea. Maybe this was a test to see how I would respond? Was called a couple days later with a negotiable offer, only minor problems with difficulty getting hold of the recruiter.",
        "questions": [
            "Given 4 coins of values 1, 5, 10, and 20, find all the combinations of coins that can add up to K.   4 Answers",
            "Create a button menu using Javascript.   4 Answers",
            "Find ways to insert data collection in Javascript events.   4 Answers",
            "Given a linked list, put all the odd elements in lexicographical order list in front of the even elements in lexicographical order in place.   4 Answers",
            "Design chess using OOP.   2 Answers"
        ],
        "date": "Feb 2, 2017"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "7+ weeks",
        "role": "Software Development Engineer",
        "details": "5 algorithmic questions got asked over and over different data structures and algorithm questions. It was difficult compared to modern hiring practices. Totally different once I joined the team. Worse thing is that the lunch interview is still an interview so watch out.",
        "questions": [
            "Mutex question   2 Answers"
        ],
        "date": "Jan 28, 2017"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "3+ months",
        "role": "Software Development Engineer",
        "details": "First round - on campus 45 minutes coding round. Flew to Seattle. Total 4 rounds in person. Three coding rounds and one behavioral + previous work experience + projects + background. All coding rounds are whiteboard coding.",
        "questions": [
            "Questions on Tree and Array. A recursive and non-recursive solution for each.   2 Answers"
        ],
        "date": "Jan 30, 2017"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "-",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "I've applied to FTE positions for years on their public site, and never gotten anywhere. However, this time I had an internal recommendation. So I went from applying to in an interview loop within a week. No phone screen or pre-screen of any sort.The full interview process was comprised of 4 one hour interviews, with various Program Managers and Software Engineers. We did white board coding and talked a lot about my past work. They seemed to really appreciate that I have an UWA in the store already, with good reviews.After the interview, it took about a month to get my offer, however, this was also over the Christmas holiday season. Some delays where due to approvers being on PTO.",
        "questions": [
            "I was sked a variety of questions surrounding the more advanced areas of C# and JavaScript.   3 Answers"
        ],
        "date": "Jan 15, 2017"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Software Development Engineer",
        "details": "I was referred by a friend of mine currently working at Microsoft. I first did a 45 minute on-campus interview which consisted of one easy question plus some behaviorals. Unfortunately, Microsoft had fulfilled their hiring quota for the year, but a spot opened up in mid-December and I scheduled my on-site to be in January.The on-site consisted of five interviews about an hour long each, with some standard data structures/algorithm questions plus one system design question. The fifth interviewer also asked some behaviorals. The algorithm questions were probably around LeetCode Medium level.",
        "questions": [
            "Given a list of n unsorted key-value tuples which are too large to fit in memory, return the k tuples with the greatest value where n is several orders of magnitude greater than k. This list may be dispersed across multiple machines.   3 Answers",
            "Given a tree of order n which is neither complete or a search tree, write a function to construct a new tree of order m in-place. Memory usage is bound to 2 times the size of the tree. The new tree must be complete, and a node A cannot be a child of another node B in the new tree if A was an ancestor of B in the old…  tree.   4 Answers",
            "Given a list of movement commands (up, down, left, right, undo previous action), write a function that returns the final (x,y) coordinate. Followup: how would you handle other kinds of commands and undoing them? What kind of design pattern is this?   2 Answers",
            "Given two very large timestamped sorted log files that do not fit in memory (possibly on different machines), merge them in timestamp order. Provide some test cases.   2 Answers",
            "Describe how you would design a data experimentation platform.   1 Answer"
        ],
        "date": "Jan 13, 2017"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "4+ weeks",
        "role": "Software Development Engineer",
        "details": "I was contacted by Microsoft University Recruiting and offered an interview. The interview lasted about 20 minutes, and we worked through a technical problem. Overall it was a good experience. They got back to me within 4 weeks.",
        "questions": [
            "Write a function, that, given a paragraph as input, outputs the paragraph with all the words reversed.   5 Answers"
        ],
        "date": "Jan 3, 2017"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Software Development Engineer",
        "details": "On-campus interview + on-site interview at RedmondContacted by recruiter for an on-campus interview opportunity. It was a short screening interview with some behavior questions and a coding question, only pseudo code needed.On-site interview consists of 4 rounds with each one 45 mins long. Both behavior and coding questions were asked in each round. It's a great experience.",
        "questions": [
            "behavior questions and coding questions   1 Answer"
        ],
        "date": "Dec 22, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ months",
        "role": "Software Development Engineer",
        "details": "All interviews are technical. Started with an on campus interview in September, but there was a hold on submitting candidates to final round that got lifted in December. Flew out to Seattle for a 4 more interviews (spaced out with a 15 min break)",
        "questions": [
            "Print out all the nodes in a binary in order without recursion.   2 Answers",
            "Return the longest palindromic substring.   2 Answers",
            "Print nodes in balanced tree level by level and reversing the print order every other level.   2 Answers",
            "Get k largest elements in a list, extremely large list (doesn't fit in memory), write actual test cases.   1 Answer",
            "Determine if a linked list is circular (give upper and lower on runtime bounds given the choices made/optimal ratio)   2 Answers"
        ],
        "date": "Dec 16, 2016"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "3 weeks",
        "role": "Software Development Engineer",
        "details": "Interviewed onsite at Seattle. Very easy questions. I got an offer after 1 day . The entire process was quick. But the offer was pretty low and the team was not ready to negotiate. Declined the offer. Please don't waste time if you are a good candidate, there are lot of companies which pay way better than MS.",
        "questions": [
            "1. Find max continuous sum in array?2. Simple graph question   2 Answers"
        ],
        "date": "Dec 5, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "3+ months",
        "role": "Software Development Engineer",
        "details": "I was contacted by a recruiter, and she set up a short phone interview. The recruiter was kind, very prompt and answered any questions I had.I then had an online round where I had to code a problem and answer a technical solution. I had to write down the answers in the link they provided. You can't copy paste anything, and the code needs to be really good (well indented, good solution, get it as close to compilable as possible, etc) It was a medium level question on leetcode.comI was invited for an onsite inteview. This was a hiring event, and a lot of people were interviewed on the same day. We were all given different cubicles, and the interviewers showed up to our room. The interviews were shorter than Microsoft's standard interviews, which meant that we had to get to the solution faster. (The HR there indirectly told us the same thing, not to waste time, try to answer questions correctly as soon as possible)There were 4 interviews, and they were all taken by manager or Director level people. They were all very kind, and all of them mentioned that they wished they had more time. The questions were not too hard, but they were definitely not easy too. Again, they were all medium level questions (one hard level question ) on leetcode.com. You get a lot of points for asking good questions, making correct use of the hints they give you, and figuring out the bugs in your code. (This if you don't get the solution straight away).I got a call two days later saying that I got the job, and I've accepted the offer.",
        "questions": [
            "I've signed an NDA, so I can't really say, but I've mentioned leetcode.com twice, so that should point you in the correct direction. There are a lot of other sites too, like careercup and haccherrank.   1 Answer"
        ],
        "date": "Dec 6, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Software Development Engineer",
        "details": "Great process. Passed the first screen interview with a full-time engineer that came to my college campus. I feel like that interview was mostly about personality and fit, more than engineering prowess. The on-site interviews was a round of 4 interviews back-to-back. Enjoyed the experience with every interviewer. The questions were not hard, but not drop dead easy.",
        "questions": [
            "Find the common ancestor in a binary tree.   4 Answers"
        ],
        "date": "Dec 11, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "2+ months",
        "role": "Software Development Engineer",
        "details": "I interviewed on campus, was asked one easy algorithm question and one object oriented question. And after waited for 2 months, I received an email from recruiter, told me I passed the interview but there was no more interview spots so they can't move me to the next round.",
        "questions": [
            "Algorithm about arrays.   1 Answer"
        ],
        "date": "Dec 11, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "I had a phone screen that I thought went pretty well. By the end, the recruiter seemed to be hinting I'd get an onsite interview, and assured me I'd hear back from her by the next week because she knew I had a deadline coming up.Well...2 weeks of silence went by. I emailed the person coordinating the interviews (I had no way of contacting the recruiter herself) and she said they'd get back with me ASAP.She never got back to me. It has now been 2.5 months of silence. Why you gotta be like that, Microsoft?",
        "questions": [
            "Just your standard non-technical phone screen with behavioral questions.   1 Answer"
        ],
        "date": "Dec 1, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "I was referred by someone who works at Microsoft, and Microsoft gave me an interview at my school campus. The interview was 30 minutes long, and there were two technical questions to be solved on a white board. One was hard, the other was easy. Both problems were vague about the exact specifications of the input/output.",
        "questions": [
            "a problem about rectangles (not the one floating around the web about determining whether two rectangles overlap).   2 Answers"
        ],
        "date": "Dec 2, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "2+ weeks",
        "role": "Software Development Engineer",
        "details": "On campus interview, introduced projects on my resume, then go directly to coding problems.The first problem is best time to by and sell stock. After a few minutes, I talk about my solution. I was not required to writing the code and directly goes to the second problem. After i finished my code, the interview think there is an easy way to solve the problem. But in the middle of introducing his idea, he admits mine was right.",
        "questions": [
            "1. Best time to buy and sell stocks. 2. find the biggest island in a 2D matrix.   1 Answer"
        ],
        "date": "Nov 30, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Development Engineer",
        "details": "White board interview at local university. Reverse an integer. Looking for optimized solution and definitely no tostring type of solution. They want to hear you think out loud and are willing to help you.",
        "questions": [
            "Reverse an integer. Looking for optimized solution and definitely no tostring type of solution   5 Answers"
        ],
        "date": "Nov 29, 2016"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "I applied at the campus fair. Then after one and half week a recruiter contacted me and arranged an interview in the campus. It was an one to one interview. The interviewer was very friendly and nice person. After couple of general question he asked me a technical question. It was easy, basic programming problem.",
        "questions": [
            "1. How to balance parenthesis in a program?   1 Answer"
        ],
        "date": "Nov 14, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "2+ weeks",
        "role": "Software Development Engineer",
        "details": "I attended the MS 30 min on-campus interview last week. I prepared a lot of behavior questions before but it turned out that the interviewer didn't ask any behavior questions. The coding problem he asked me was to find the next larger element in a BST. He didn't even defined the BST and the function declarations for me, so I had to define it by myself.",
        "questions": [
            "The coding problem he asked me was to find the next larger element in a BST.   2 Answers"
        ],
        "date": "Nov 14, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Development Engineer",
        "details": "I got a call for an on-campus screening post career fair. The interview was scheduled a week before. On the day of the interview, I had a one on one with the engineer where I was asked a coding question and I was expected to write bug-free optimized code on paper with focus on complexity. I got a reject via mail within the next 5 days.",
        "questions": [
            "Merge 2 sorted linked lists such that the final linked list is sorted   1 Answer"
        ],
        "date": "Nov 14, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Development Engineer",
        "details": "They come and host office hours at my school, and I talk to a recruiter. I tell him about what I love, especially math, and I apply online to the Explore program. I get contacted about an interview for the regular SWE position, and I'm overjoyed. They met me at a local center at my school, and asked me questions about my resume. They were super nice and I loved every part of the experience.",
        "questions": [
            "Reverse words in a sentence so likeex: to be or not to bereturn be to not or be toNote: I'm a freshman in college and he knows I don't know much so I got an easy question   3 Answers"
        ],
        "date": "Nov 10, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Development Engineer",
        "details": "The whole process take 6 months. The interview process take half day. 4 turns back to back. Each takes 45 minutes and 15 minutes to break. Code only take 10-20 minutes, easy-medium difficulty. More time spent on asking detailed and improvement on former projects. Not performed well on behavior questions.",
        "questions": [
            "What is the project you most proud of and how can you improve it.   Answer Question"
        ],
        "date": "Nov 9, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "5 weeks",
        "role": "Software Development Engineer",
        "details": "On-Campus interview followed by final round in Redmond. The process took 30+ days since all the spots were taken by the time I was signing up. On-Campus was easy with some basic algorithm questions (sorting, tree, etc). Final round was four 45-minute interviews (thought some people only had 3). Lunch was provided.",
        "questions": [
            "Simple design questions like messaging and elevator controller   1 Answer"
        ],
        "date": "Nov 7, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "30 minute on-campus interview. Had very brief introductions, an algorithm question, and a couple of minutes for questions. Overall, the very short amount of time left me feeling rushed and with a bad taste in my mouth, since it was clear that the only thing that actually mattered was the single algorithms question.",
        "questions": [
            "Q: In an array that has one value for more than half of its elements, how can you find that value?   4 Answers"
        ],
        "date": "Nov 3, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Development Engineer",
        "details": "Applied through university a while ago, but it took an incredibly long time to get the final round interview which was very frustrating. Questions weren't hard, but finding the optimal solution was the bigger challenge. I also got asked a bit manipulation question that was difficult for me having never come across those problems before and having never use those functions before. The actual final round interview experience was enjoyable, but the lack of communication before that was very frustrating to deal with as I got notified of my final round with less time to prepare than I had ideally wanted.",
        "questions": [],
        "date": "Nov 1, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2 weeks",
        "role": "Software Development Engineer",
        "details": "I applied via campus career fair, then it takes around one week to get the on-campus interview. After one week of the on-campus interview, I was invited to the San Francisco doing the on-site interview. Everything goes on very well, people are nice, food is good, etc. We had four round interviews, coding based and behavior questions also.",
        "questions": [
            "Some data structure questions about array, tree, etc.   Answer Question"
        ],
        "date": "Oct 30, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "3 weeks",
        "role": "Software Development Engineer",
        "details": "I had the initial phone screen and got rejected 3 weeks later. They asked me a series of behavioral questions, and one logic puzzle (fruits and baskets with wrong labels).I am surprised and disappointed in the rejection because I feel that I'm a strong candidate (had final round interviews with very competitive companies). I solved the brain teaser and felt I did a decent job on the behavioral aspect. However, my interviewer was NOT a technical person, so she couldn't answer any of the more technical oriented questions I asked at the end. I remember my interview only lasted about 20 minutes. She ended my interview before I could think of more questions to ask. I am very confident that if I had a technical person interview me, they'd have a way better understanding of my skill set.Needless to say I won't be applying to Microsoft again.",
        "questions": [
            "Three baskets. One has apples, one has oranges, one has both. They are all labeled incorrectly. Find out which basket contains which with only 1 draw.   1 Answer"
        ],
        "date": "Oct 18, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Development Engineer",
        "details": "on campus interview it was 30 minutes long, they seem to interview a large selection of people in the first round interviews to get a good idea of who the top talents really are regardless of what you have on your resume you have a solid opportunity if it through a campus recruiter to get into the first round interview. Its definitely kinda intimidating because they send an engineer to interview you, so judgement is very fair, you dont really need to click with the interviewer as long as you can implement your code properly.",
        "questions": [
            "reverse the order of a sentence   1 Answer"
        ],
        "date": "Oct 17, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "I received a conformation email from the company with time, location, and dress code. At the interview I was asked a few questions about personality and a single coding question.",
        "questions": [
            "Reverse a singly linked list.   1 Answer"
        ],
        "date": "Oct 25, 2016"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Development Engineer",
        "details": "Campus Recruiting Resume submitted and interview request through email on resume. Interviewer was extremely kind. The interview scheduling process was very quick however is taking a very long time to get the resu lts back.",
        "questions": [
            "Implement a class with wrappers and hashes   Answer Question"
        ],
        "date": "Oct 24, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "Got the interview at a conference. It was scheduled on site after I spoke to a recruiter at the Microsoft booth at the career expo. They were a little disorganized the day of the interview. It was early in the morning and I was one of the first interviews that day.",
        "questions": [
            "Walk me through your resume. Tell me about a time you had to overcome an obstacle. How would you check if two strings are anagrams.   2 Answers"
        ],
        "date": "Oct 22, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "The interviewer asked me which fields I'm most interested in, and what classes I'm taking, and then went straight to the coding part. After the coding part, he asked me whether I have any questions to him, I asked something about Microsoft and the time was over. It's a 30 min interview.",
        "questions": [
            "Implement a class Stack   1 Answer"
        ],
        "date": "Oct 3, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Development Engineer",
        "details": "On campus first round interview. I submitted my resume in career fair and got an email to register interview 2~3 weeks later. The interview was about 30 minutes. Asked general behavioral questions for 5~10 minutes and gave a coding challenge.",
        "questions": [
            "Asked question about resume, and asked to talk about something that I did not mention on resume.Binary Search Tree related question   Answer Question"
        ],
        "date": "Sep 29, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Development Engineer",
        "details": "Campus interview30 minutes, questions about resume -> one coding question -> ask questionThe interviewer was pretty nice and patient and gave hints and advice during the processMake sure to show your passion about Microsoft productAfter two weeks got invitation to the final round onsite interviewWill have it next week, hope i can do well",
        "questions": [
            "give a linked list and remove a node of the given index   2 Answers"
        ],
        "date": "Oct 7, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "a week",
        "role": "Software Development Engineer",
        "details": "An on campus interview and an 4 round onsite interview. The process is very fast, I got the result in 3 days after the on campus interview and in only 1 day after the on site interview. Recruiters and interviewers are very nice. The campus is beautiful and the city (Seattle) is also very great.",
        "questions": [
            "Projects, Some coding questions and test cases.   Answer Question"
        ],
        "date": "Oct 9, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Development Engineer",
        "details": "Got a phone screening and I chose all positions that I am interested in, from UX design to software engineer intern. I got a pretty general phone interview, which includes many behavioral question and a couple of tech questions, plus a math puzzle. Overall, the interviewer is very patient and helpful.",
        "questions": [
            "Difference between java and c++Describe a teamwork experienceA couple of tech questions   Answer Question"
        ],
        "date": "Oct 10, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Development Engineer",
        "details": "Interviewer was nice and conversational, he asked some basic behavioral questions followed by some light technical questions. I'd say the majority of the interview was behavioral. He asked me to describe some previous work, why I wanted to work for Microsoft, and what I wanted to work on there. If I could go and do it again I would have tried harder to carry the interview and sell myself.",
        "questions": [
            "In-place reversal of a linked list.   1 Answer"
        ],
        "date": "Oct 13, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Development Engineer",
        "details": "Phone interview that asked a simple coding question and then basically behavioral questions. Then onsite four 45-minute interviews. One of my interviews was a PM interview despite applying for a software development role, but it makes sense that you have to understand both sides. There was also a design-ish interview where I had to think through all the parts of an app and design use cases.",
        "questions": [
            "Basic data structure and O(n)   Answer Question"
        ],
        "date": "Sep 6, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Development Engineer",
        "details": "Got interview thru recruiter. asked basic coding questions and some brain teaser questions. Seems like the recruiter didn't communicate w/ the microsoft folks very well. Had a very big company feel. Decided not to pursue.",
        "questions": [
            "basic stuff   Answer Question"
        ],
        "date": "Sep 4, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Development Engineer",
        "details": "The interview was very casual, no stress and formal clothe not necessary. A few simple behavioral questions were asked before the technical ones. The interviewer was helpful and seemed like a friend who was trying to get you through the interview.",
        "questions": [
            "Q: Binary trees, linked list, pretty much topics related to data structures.   Answer Question"
        ],
        "date": "Sep 27, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "-",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "Did an on campus interview, which was very smooth. Asked 2 coding questions on a sheet of paper and was given a chance to ask the interviewer questions. Then flown out to do an on-site interview.",
        "questions": [],
        "date": "Sep 20, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "5 days",
        "role": "Software Development Engineer",
        "details": "was on a Face to face with the manager and a lead and one more developer ..Most of the basic questions.Interested in Angular MVC design Pattern and Entity Framework.they were also more into Sql server . Oracle Toad and usage of EDMX files.",
        "questions": [
            "c# basics,DependencyInjection ,why u wanna work here   Answer Question"
        ],
        "date": "Aug 5, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Development Engineer",
        "details": "Took part in an interview event which lasted about half of the day. Four rounds of approximately one hour interviews with short breaks in between. The questions were based on algorithms and Big-O notation for run-time and space complexity. Questions were either straight from or similar to questions in Cracking the Coding Interview. Make sure you understand the complexity of the code you are writing or at least be able to walk through the calculation of it. Practice solving problems from Cracking the Coding Interview and you should do fine.",
        "questions": [
            "graphs, queues, strings, heaps, and other common algorithms.   1 Answer"
        ],
        "date": "Jul 26, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "4+ weeks",
        "role": "Software Development Engineer",
        "details": "Multiple phone screen - first with recruiter then with hiring manager. Finally after a few weeks called for onsite interview. The all day interviews are brutal and you have to be on top of your game all day. The last interviewer makes the hiring call",
        "questions": [
            "Usual string, array, linked list questions. Given two nodes in a tree, find the lowest common ancestor   1 Answer"
        ],
        "date": "Jul 27, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Development Engineer",
        "details": "On campus interview with Office engineer. Visited school prior to interviews with junior engineer to do resume drops and talk about the culture/expectations during the interview. Very friendly and stressed the importance of learning skills and communicating on the job.",
        "questions": [
            "Swap lower/uppercase ignoring special characters.   Answer Question"
        ],
        "date": "Aug 23, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "First we had a aptitude test. Shortlisted students went through a coding round. After this shortlisted candidates went for face to face interview rounds. Depending on performance people went through 3 - 4 rounds of interviews. After these there was again a quick coding round with the final shortlist (One person was rejected in this round).",
        "questions": [
            "The question was: Given a text written in some language where the alphabets are represented with 1 byte or 2 byte. But the one byte alphabets always have their MSB 1 and the 2 byte charecters always have their MSB 0. Now when at some point user presses a back space how many bytes are to be deleted to erase the alphabet?   3 Answers"
        ],
        "date": "Aug 25, 2016"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "It was easy given that the position was for entry-level undergrads. There were few design questions, some simple algorithms and few test cases. There were three technical interviews followed by a technical cum HR interview with hiring manager. All interviewers were really helpful. Each round lasted fifteen to twenty minutes and the round with hiring manager was for half hour.",
        "questions": [
            "Design a snake-and-ladder game   1 Answer"
        ],
        "date": "Aug 11, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "5+ weeks",
        "role": "Software Development Engineer",
        "details": "Applied online. Recruiter schedules an Interviewer. The first phone call was about a single puzzle. Then got invited for onsite. They told me the team I would be interviewing an hour before the interview. Didn't get much to prepare specifically. The interviewers asked role specific question which I wasn't even aware of.",
        "questions": [
            "System design questions   Answer Question"
        ],
        "date": "Aug 18, 2016"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "a week",
        "role": "Software Development Engineer",
        "details": "Got a phone interview after referral. The phone interview is very fast, just 30 mins. The recruiter is very nice, just ask about my information. After that, the recruiter told me intern positions had been filled through email.",
        "questions": [
            "Introduce yourself. Talk about resume. Asked interest (backend or frontend).   Answer Question"
        ],
        "date": "Oct 13, 2017"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "1 day",
        "role": "Software Development Engineer",
        "details": "Started with a phone screening followed by an on site interview. Company pays for flight, meals, and lodging to Seattle for the interview, onsite interview consists of 3-5 interviews with a lunch with one of the interviewers.",
        "questions": [
            "Find the closest common ancestors to 2 nodes in a n-ary tree.   2 Answers"
        ],
        "date": "Dec 6, 2017"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1+ week",
        "role": "Software Development Engineer",
        "details": "Got a phone interview through a referral. I was contacted by a recruiter to schedule a phone interview, which I had a few days later. The on-site interview was much more difficult.",
        "questions": [
            "Please delete a given node from a sorted singly-linked list.   1 Answer"
        ],
        "date": "Dec 14, 2017"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Development Engineer",
        "details": "I was contacted by a recruiter for an hiring event organized by one of the groups in Microsoft. Overall very smooth interview experience, first I was asked to complete an 1 hour online test, and following that I attended an onsite event.",
        "questions": [
            "Two system design, two coding interviews.   Answer Question"
        ],
        "date": "Dec 18, 2017"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Development Engineer",
        "details": "It was a 30-min interview which consisted of behavioral and technical questions.Since there were both types, even though the difficulty was not great, it always seemed like there was not enough time.",
        "questions": [
            "Reverse words in a sentence.   1 Answer"
        ],
        "date": "Nov 12, 2017"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "Career fair, talked with recruiter, liked my resume, got an email and scheduled a phone screening with puzzles and simple theoretical questionsthen had an 3 on-site interviews at their branch in Cambridge",
        "questions": [
            "resume questions and alot of talking about projects I have done in detail   1 Answer"
        ],
        "date": "Nov 7, 2017"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4 weeks",
        "role": "Software Development Engineer",
        "details": "The recruiter sent me an invitation for an on-campus technical interview. I was asked to schedule the onsite the next day. I asked for three weeks to prepare. The onsite process is pretty standard as many other companies. I had four interviews all of them with senior developers/managers in the respective teams. I was asked questions related to DP and Backtracking. CTCI along with decent practice from Leetcode is enough to crack the interview. We need to be careful testing the code we write.",
        "questions": [
            "On-campus - related to a data-structure designonsite - DP, Backtracking and a question on palindromes.   1 Answer"
        ],
        "date": "May 23, 2017"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Easy Interview",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "On campus interview. The interviewer asked some basic list reversal questions, didn't even look up at the board for my answers. Spent the whole interview checking email. Felt like he thought he had better things to do.",
        "questions": [
            "Reverse a doubly linked list.   3 Answers"
        ],
        "date": "May 8, 2017"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Development Engineer",
        "details": "The interview process for Microsoft was pretty standard. I got in through the college career fair, so they had one technical interview in person at the college campus and then 4 rounds of technical interviews at Redmond. The provided with really good accommodation for the onsite interviews and also provided with a discount voucher for the Microsoft Store.",
        "questions": [
            "The questions were standard technical questions like linked list manipulation, string parsing and graph traversals.   1 Answer"
        ],
        "date": "May 26, 2017"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Software Development Engineer",
        "details": "Initially, recruiter contacted and discussed the position. Got an online test and got an onsite invitation. The interviewers were friendly and made sure you are feeling comfortable. Most of the questions were from basic data structures, Prepare recursion. Medium leetcode questions. Had total of 4 onsite rounds and 3 were ds and 1 was design round . Signed NDA so can't tell the actual questions",
        "questions": [
            "Recursion, Design, Medium leetcode questions   Answer Question"
        ],
        "date": "Sep 13, 2018"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2 weeks",
        "role": "Software Development Engineer",
        "details": "1. apply online;2. got an email from hr to schedule phone screen;3.finish the phone screen;4. if passed, get an email from hr to schedule an onsite interview;5. four or five round interview. will have a lunch if interview starts in the morning;",
        "questions": [
            "design a paging api   Answer Question",
            "word ladder   Answer Question",
            "skyline   Answer Question",
            "deep copy a linked list. the node has value, next and random. random will poitn to a random node and may point to itself   Answer Question"
        ],
        "date": "Aug 27, 2018"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3+ months",
        "role": "Software Development Engineer",
        "details": "Had an on campus interview followed up by on site interviews. They let me know their decision in about a week and a half. Overall had a great interview experience and really liked all my interviewers.",
        "questions": [
            "Asked about past projects   Answer Question"
        ],
        "date": "Feb 2, 2018"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "I had a recruiter phone screen and then went directly to the onsite. For preparation, I used techinterviewclub.com which has recent Microsoft questions. The recruiter got back to me in one back and got the offer.",
        "questions": [
            "Deeply clone a singly linked list in which each node has an extra pointer that points to a random node.   3 Answers"
        ],
        "date": "Feb 10, 2018"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4 weeks",
        "role": "Software Development Engineer",
        "details": "I had a phone call with HR and then followed by a technical call which consisted of 10 mins of technical questions and followed by a coding online in a link shared by the interviewer . The question only tested the basic programming knowledge and debugging skills. I was later called for a face to face interview at Bellevue office. The interview was three rounds one on one with three interviewers in their offices. I was asked to write code on whiteboard. There was time allowed for lunch with one of the interviewers after the first round of interview, where i had a casual conservation about the place and food etc, nothing technical during lunch time :)",
        "questions": [
            "Data Structure, Debugging skills, Performance improvement   Answer Question"
        ],
        "date": "Mar 30, 2018"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Development Engineer",
        "details": "The interviewers were very warm and friendly. Asked basic questions on the previous work experience and few array/string manipulation questions and on data structures.The interview process was very tiresome as it lasted from morning till evening.",
        "questions": [
            "Detect a loop in linked list.   1 Answer"
        ],
        "date": "Mar 14, 2018"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Software Development Engineer",
        "details": "30 min phone screen with recruiter. Mostly behavioural chat with a few technical questions.Onsite interviews 4 back to back 45-min interviews with Engineers. Standard behavioural questions about resume/projects then followed by technical problems focusing on data structures and algorithms.",
        "questions": [
            "Pretty standard sorted array, binary tree, string, sorted array, string questions   Answer Question"
        ],
        "date": "Dec 12, 2018"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "Came in for a 30 minute campus interview. They asked about resume background and then straight into coding question. The guy was about 20-30 minutes late for the interview and gave me only 10 minutes to solve the coding question.",
        "questions": [
            "Count number of loops in doubly linked list   Answer Question"
        ],
        "date": "Dec 12, 2018"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "Applied Online. Was contacted for a 30 min on-campus interview. which consisted of Behavioral followed by technical questions.After that 4 45 mins on site. All 4 rounds were technical and resume based.",
        "questions": [
            "Round 1: Resume based and binary tree to linked listRound 2: Skyline problem(Leetcode)Round3: Design question(identify classes, data structures, code)Round4: String manipulation   Answer Question"
        ],
        "date": "Dec 7, 2018"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "3+ months",
        "role": "Software Development Engineer",
        "details": "I would like to start out by saying this has been by far been the worst, most poorly handled, and longest (by a long shot) interview experience I've ever had to deal with.It started out with a phone screen, the developer over the phone made me excited for the team I wanted to interview for. The talk was great. I moved onto the onsite after getting the news I did well over the phone and giving my initial recruiter total compensation expectancies as well as additional information.The onsite went really well. All of the members of the team that I interviewed with, as well as other developers in the org, made me really want to come work there. Most of them seemed excited about their work and they all seemed like people I would want to work with.Waiting to hear back took a couple of long weeks. I had no insight into what was going on behind the scenes. Some time later I received a phone call from my first (yes, first and honestly it may have been the second) recruiter saying that I \"needed\" to come in... onsite, and have another interview with a different hiring manager for a different team. I took another day off and did that.This mainly consisted of telling me that my interview feedback was good, and that they would have openings in the near future and that they would want to extend an offer at that point, but I just needed to hold out and wait. He explained the team, which was something even more in my wheel house, which made me even more excited, this time knowing for sure that I would have an offer coming my way.Another couple of weeks later, I receive an email from yet another new recruiter who didn't have any of the original information I had previously given my last recruiter. She wasn't even completely up to date on what teams I had interviewed with or what my story was. No big deal, I gave her all of the information, but clearly no communication from internal recruiters.Eventually I was made an offer. In my opinion, knowing what other developers were being offered, it was a really low ball offer. I had explained I would actually be losing money with the offer they made me. The recruiter took the offer back to the hiring manager with my comments and a few days later contacted me saying she wanted to talk again about my offer.She was very blunt when we finally got on the phone. She explained what she thinks she would have been able to do for me compensation wise, but said she had bad news. She told me they lost the head count and would be pulling the offer off the table, and that she was sorry.I have since tried to contact my recruiter to see if their is possibly other teams within the org that could use my positive interview feedback for a hire, but she is no longer responding.Ultimately, it's time to move on. This experience has made me question why I was even excited to work at Microsoft in the first place. If this is how awful the recruiting/budgeting and hiring process is, it makes me wonder what else is like this internally at Microsoft. All in all, just a terrible experience where I was a hot potato with very little insight and clarity into what was actually happening after being told I would receive an offer.For what it's worth, Microsoft isn't actually offering as much as some other smaller companies. If money is something that is important to you, you'll be better off not dealing with this and looking elsewhere.",
        "questions": [
            "A graph question.   1 Answer"
        ],
        "date": "Nov 15, 2018"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "It is a phone interview in Azure group. He introduced their mainly task and then, there are total two algorithem problems. He is really nice but I didn't finish the second question. Finally, one opportunity for me to ask them one question.",
        "questions": [
            "start with an easy DFS problem, make sure you understand time complexity and space complexity according to stack. then a new binary search problem.   Answer Question"
        ],
        "date": "Nov 21, 2018"
    },
    {
        "gotOffer": "Declined Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "a week",
        "role": "Software Development Engineer",
        "details": "That was a campus interview in UCSB. Some MSFT engineers come to the compus, filtered out some candidates by email, then ask the remained candidates to take a 2nd round 1 on 1 interview. That was a 30 min interview,5 min behavior questions first, then 1 coding question. Very easy.",
        "questions": [
            "What is your favorite Microsoft product?   1 Answer"
        ],
        "date": "Nov 20, 2018"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Development Engineer",
        "details": "On Campus Screening InterviewBefore I go into detail about the interview, I want to just say that I may not be good enough for Microsoft and I am totally OK with that. I am not okay with not being given a fair shot and being rushed through an important interview. I can't say if a different situation would have changed my outcome but that doesn't change the fact that this interview was horrible and left a super bad taste in my mouth for Microsoft.My interviewer was over a half an hour late. Then his stomach was rumbling obnoxiously loud throughout the whole interview. It was so incredibly awkward and I felt like my whole interview was rushed.The question was pretty weird too and was not an algorithms question. I felt like he was just zooming to get to lunch.He stopped me after I worked through most of the question so I could ask him questions because he said it was important that I had time for questions. But before I asked him questions he proceeded to explain to me how hungry he was and how he was missing lunch and they were way behind schedule.I literally asked one question and told him that was all I had. Like you just professed your hunger to me and I can hear your stomach rumbling like crazy, why would I continue to ask questions.The weirdest and most unprofessional interview of my whole interview season.",
        "questions": [
            "It was dumb java event handling question. Nothing to do with algorithms. Pretty weird question   Answer Question"
        ],
        "date": "Oct 24, 2018"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3+ weeks",
        "role": "Software Development Engineer",
        "details": "There was one phone screen, and four tech interviews over Skype. The overall process was smooth and very positive. Communication from the company was quick and effective. I got details about an offer within a day of completing interviews.",
        "questions": [
            "I was asked a couple coding questions, a couple design problems on concurrency and scalability, but most of my interviews were discussions about past projects and experiences.   2 Answers"
        ],
        "date": "Oct 16, 2018"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "1 day",
        "role": "Software Development Engineer",
        "details": "First one round phone interview then three rounds onsite. Lunch with team member.Each round starts with self introduction, then two problems. Interviewers are very nice and the working place is really nice.",
        "questions": [
            "Merged K sorted Linked List   1 Answer"
        ],
        "date": "Mar 27, 2019"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Development Engineer",
        "details": "Ultimately, I am here to voice a warning to other developers, and hopefully a wakeup call and initiation for action from Microsoft. The 60 minute online test which I took was stressed to be 3 questions, but instead had 5. The first three were all of the same question form (what is wrong with this code and fix it), but in different languages. It was clear to me these were standins for eachother, and you could choose which one to solve, as the test was only to be 3 questions in 60 minutes, not 5 questions. It would be absurd to have to finish all three of these (c++,typescript,react), especially as the test was also stressed to be language agnostic. Why am I even forced to a language type for these questions in the first place if the exam is language agnostic?In addition, the test did not actually state that one did or did not have to complete all 3 of these quasi-duplicates, which means I had no way to tell whether this was a poorly stated 3 question exam, or a terribly constructed 5 question exam with an absurd timelimit. I was told I did not answer some questions, of which I did not answer the duplicates of course, and was not passed. Did the person grading it not know it was a 3 question exam? How is that even possible, unless the person was not informed on how to grade the exam properly? Do the people collectively managing this hiring process communicate together about the process itself? On communicating all of these concerns, I have received no feedback, and the recruiter has seemingly ceased communications. How ironic.Red. Flags.So many red flags.This is a major failure on their part, and I cannot support or take part in this process, so I will not be re-applying to Microsoft for any position.**And in addition to all these issues, the recruiter invited me to an event previously, which I prepared for... but since she invited me to a second event as well, the initial invitation was no longer on the table, which I was not ever informed of. It turns out there is a process of technical screening beforehand, which I was never informed or updated about. So I scheduled for a day at their campus, and that was a bit poor on their part, too.",
        "questions": [
            "Convert infix expression to postfix expression.   Answer Question"
        ],
        "date": "Mar 21, 2019"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Development Engineer",
        "details": "Telephonic followed by on-site interview. Only covered my projects because it was for a University Grad role. On-site consisted of four whiteboard rounds. Each of those was an algorithms/data structures question.",
        "questions": [
            "Given a string implement a compression algorithm.   1 Answer"
        ],
        "date": "Mar 24, 2019"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "2 weeks",
        "role": "Software Development Engineer",
        "details": "The recuiter approached after I had applied for couple of different events. They found resume in the system and asked me for my availability. First step was an online assessment test, which was very easy. Then they flew me over to Washington for an on-site interview.Onsite consisted of 4 interview round. 3 coding rounds and 1 OOP.It was a recruitment drive, so the afternoon batch has 12-15 candidates and same for morning batch as well. The candidates were treated very nicely. The interview questions were easy to medium level from Leetcode. Focus on Data-structures and OOP.",
        "questions": [
            "Can be found on Leetcode.   1 Answer"
        ],
        "date": "Jun 2, 2019"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Development Engineer",
        "details": "I went to the career fair then got contacted for campus interview. This interview was pretty chill and questions were easy. Then they flew me over to Seattle and I had 5 in person interviews. I thought I did well but got rejected. First three interviews were technical heavy while next two consist of some behavioral and design questions. I learned alot even though I did not get an offer.",
        "questions": [
            "Install dependencies.   Answer Question"
        ],
        "date": "Apr 8, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "5 weeks",
        "role": "Software Development Engineer",
        "details": "I was initially contacted by a Microsoft recruiter via LinkedIn. After a brief exchange of emails, I had a telephonic interview scheduled roughly 2 weeks after initial contact. The interview itself was pretty straight-forward and mostly behavioral, although there was an emphasis on explaining past projects in detail. The interview concluded with the \"9 Marbles Brain Teaser\" question. After about 4 weeks, I received a followup email.",
        "questions": [
            "The Nine Marble Question   Answer Question"
        ],
        "date": "Mar 30, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "Sent in resume, got a phone call that was very high-level and just asking things like am I allowed to work in US, etc. Then I was sent info to set up a technical lync interview with the project lead. This was enjoyable and fairly relaxed. You type code in whatever language you want. I think they like to see your thought process and they will help you if you talk through it and ask questions.",
        "questions": [
            "Reverse a linked list. Implement and evaluate expected runtime of bogoSort.   Answer Question"
        ],
        "date": "Mar 26, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Difficult Interview",
        "length": "1+ week",
        "role": "Software Development Engineer",
        "details": "Intense, fun, challenging and also learnt a lot. They weren't sure what the project would be but wanted to make sure that I would commit and should the project go down, they assured me I would get transfered elsewhere. Not very re-assuring.",
        "questions": [
            "Lots of brain teasers   1 Answer"
        ],
        "date": "Mar 26, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ months",
        "role": "Software Development Engineer",
        "details": "Interview process is very smooth. Starting from On-Campus interviews to On-Site interview. The logistics provided by Microsoft are awesome :stay, food, tickets, coupons etc. It was a good experience and learning. The interview is not difficult but one must present accurate answers and should not miss corner cases.",
        "questions": [
            "Given a linked list change swap each sequential pair of two elements.   Answer Question",
            "Queue implementation with fixed array size   Answer Question",
            "Given an array, find median element   Answer Question"
        ],
        "date": "Mar 26, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "1 day",
        "role": "Software Development Engineer",
        "details": "I was brought in for an interview on my college campus. The interview was very short and strictly technical. I felt that the question I was asked was very simple and I heard that they asked the same question to all of the candidates they interviewed that day.",
        "questions": [
            "Write a function to delete an element from a singly linked list.   Answer Question"
        ],
        "date": "Mar 25, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Neutral Experience",
        "difficulty": "Easy Interview",
        "length": "2+ months",
        "role": "Software Development Engineer",
        "details": "Phone call after applying. Quick behavioral questions. Final question about 9 marbles, 1 heavier than all of them, find it using a 2 plate scale.Get an email inviting me to fly out a month later. They set you up with a nice hotel in Bellvue, WA and a rental car (if chosen). Pay for all your meals - an allowance of $75 a day or something in that area. Day of the interview comes, they pick candidates up together in a party bus infront of the hotel. The bus had flashing strobe lights and neon green lighting at 7am in the morning. It was funny if anything, but quite silly.Throughout the whole thing, I never get told what I was interviewing for. They finally told us and I was COMPLETELY uninterested in the team. That spiked my confidence down. I could've saved MS $2,000+ for my trip if they told me that upfront, I would've declined. Even after talking to all the interviewers, it clearly wasn't for me. So how they got that from my resume I'm not sure.But, that doesn't mean I didn't give it my best shot. Four 45 minute interviews with 5 minute breaks in between for food/drink. The atmosphere was wonderful. It was a great confidence booster. I felt awesome and confident I could nail the position anyway, and after the first interviewer I was told that mobility was a nice perk of the job without even asking! The interviewers started with questions about me, my past projects, strengths/weaknesses, technical questions next, and left maybe a minute or two for questions about them.Technical questions were:-Implement circular array with a k-step elimination-Return sub-array with a maximum continuous sum-Check for a tic-tac-toe winner given a matrix-Without knowing the size of an array, find an element.Strongest interview I think I've ever had. Yet I was told 2 work-days after leaving that they passed on me. I think I fell short on the last interview, with the element in the array, because I didn't realize try-catch was an option to use in a interview. My previous work experience does NOT use try-catch loops, that's a big no-no, they're super slow. I've always used assertions. I got halfway through the question before that and he was unhelpful in pointing out options to solve the problem. He was also a very off-putting interviewer, and didn't seem organized.The other 3 interviewers I had - we laughed, we discussed interesting topics like AI/machine-learning, I nailed the technical questions from start to finish with room for testing and optimization, it was a great time. So my best guess is that last guy talked bad of me, and I was told you need all 4 to basically love you to get in. Waste of time, waste of money on their part.Summary - super easy interviews with laid back atmosphere, great hospitality, but you're left in the dark with what you're interviewing for until the day of and all it takes is 1 interviewer to be stubborn and unreasonable.",
        "questions": [
            "Without knowing the size of an assumed sorted array, find an element provided.   1 Answer"
        ],
        "date": "Mar 2, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Development Engineer",
        "details": "First round was on campus university. Then they flew me to MS for the second round at Microsoft's headquaters in Redmond. I had 4 interviews on that day of 45 minutes each. I had 15 minutes break between each of them. 3 technicals and one behavioural only. My trip to Redmond lasted 3 days including fly days.",
        "questions": [
            "1. Given a sorted matrix, find an element if it exists.2. Given an array of integers with positives and negatives values. sort it in a way where all negative values are on the left side by keeping the relative order. Do it in place.3. Given an array of a stock value for each day, give an algorithm to find the maximum profit possible between a buy-day and a sale-day.  …  Answer Question"
        ],
        "date": "Feb 26, 2015"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "4+ weeks",
        "role": "Software Development Engineer",
        "details": "Sent in application for SDE, SDET, and IT positions in October. Near the end of January a recruiter called me to schedule a phone interview. 30 minute phone interview with an Engineer from the team I interviewed with asked basic questions:- How do you troubleshoot your home network?- How would you describe virtualization to your grandmother?- Questions about projects on my resumeThe next week I was selected for an on-site. All expense paid trip to Redmond. Flew me in, stayed 3 days 2 nights in a sweet hotel, rental car, fancy meals, the works.The on site interview was with 4 engineers from the same team. 45 minute interviews with each one. Most of them were simple conversations. If you make it to this round it's basically a culture fit. They didn't ask a single code question and none of those stupid \"How many golf balls fit in a school bus\" type questions. The whole team was really good. Less than a week later the recruiter contacted me with an offer. They're looking for people that love what they do and love to learn and grow on their own. It's the whole culture they support up there.",
        "questions": [
            "Design a service to automate the interaction between locked and encrypted Nokia Phones and Microsoft.   Answer Question"
        ],
        "date": "Feb 25, 2015"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Easy Interview",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "A applied online through their website and after 2 weeks they contacted me for Skype interview. The interview was very enjoy and took about 15 minutes. This was HR interview. We talked about resume and my background. In the end of the interview, she asked me a simple quiz question about marbles.",
        "questions": [
            "You have 9 balls, equally big, equally heavy - except for one, which is a little heavier. You have a pair of balance scales and how you identify the heavier ball?   1 Answer"
        ],
        "date": "Feb 25, 2015"
    }
]