[
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "-",
        "role": "Software Development Engineering",
        "details": "I visited their booth at my University's career fair and then got an on-campus interview about 1 and a half months later. The on-campus interview was a short 30 minute interview where I got asked questions about linked lists: How would you determine if there is a cycle in a linked list? How would you find the head of the cycle i.e. where the cycle starts? How would you find the kth element from the end of a linked list? Then about 2 weeks later I got an invitation for interviews on-site and about 3 weeks after that I flew out to Redmond. I had 4 interviews on-site which had behavioral questions and also coding questions like: How would you test a phone (your simple 20 year old phone)? Give test cases for some functions whose implementation is not know i.e. blackbox testing. The people there were great and I really liked their campus.",
        "questions": [
            "Given a linked list with three fields: a data field, a next field and a random pointer field (which is a field that points to null or to an element in the linked list) write a function to return a copy of the linked list without destructively modifying the original linked list   6 Answers"
        ],
        "date": "Dec 18, 2014"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "3 weeks",
        "role": "Software Development Engineer",
        "details": "I was messaged by Microsoft recruiters from Linkedin. They sent me an online assesment which you have to complete in 60 minutes. If you pass that you will be able to go on-site. I interviewed at Microsoft on campus in Redmond for a full day loop of 6 people. Everyone was super friendly and super excited about future of Microsoft under new CEO leadership.",
        "questions": [
            "Signed NDA Contract. Algorithmic and Design Architecture Problems. They drill you deep on multi threading and distributed systems.   3 Answers"
        ],
        "date": "Mar 3, 2017"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "3 weeks",
        "role": "Software Development Engineer",
        "details": "I got referred to a specific team at Microsoft as New Grad hiring was halted for 2016. Talked to a manager on the phone for an hour, and was asked about my resume and did a interview question. Was flown to Seattle 2 weeks later and had an onsite interview with the team at Redmond. It consisted of 5 interviews with coding and culture-fit questions. I was at the Microsoft Campus from 9AM to 4:30PM. The process was nice, and the interviews were more conversational than say Google onsite interviews. I got a call 2 days later with an offer to join the team.Microsoft enjoyed asking data structure questions with arrays, linked lists, strings, etc. Questions on graphs are said to be rare. Be prepared to answer any design questions, which may be follow up questions to coding questions.",
        "questions": [
            "Questions on string traversal, arrays + math were common in my interview.   4 Answers"
        ],
        "date": "Apr 5, 2017"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "4 on-site interviews over a day with lunch in the middle. Each interviewer explained what they did, what the context of the question was, and the rest of the interview was spent solving the technical question. All four interviewers asked a question from a different domain.",
        "questions": [
            "Create an algorithm to reverse a string in-place.   2 Answers"
        ],
        "date": "Apr 21, 2017"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Negative Experience",
        "difficulty": "-",
        "length": "-",
        "role": "Software Development Engineer",
        "details": "I was contacted by the recruiter for the SDE position for their hiring event. I was asked to register and will get the Online test in a week. It's been more than a month since than. I tried to reach the recruiter many times but won't respond back. Any other recruiters won't accept my application since I was contacted previously by other recruiter. I don't understand whether they really are looking for engineers or an applicant just suffers because of all this inside conflicts. It's not believable from such a good company.",
        "questions": [
            "Why Microsoft?   3 Answers"
        ],
        "date": "Apr 17, 2017"
    },
    {
        "gotOffer": "No Offer",
        "experience": "Positive Experience",
        "difficulty": "Average Interview",
        "length": "4+ weeks",
        "role": "Software Development Engineer",
        "details": "I applied and got an on-campus interview because of a connection with Campus Recruitment.The interview was quick, with a coding question, some resume review, and a question about explaining and making a simple diagram of a previous project. Not a very personal experience, and I likely did not stand out enough as a confident candidate.",
        "questions": [
            "Given the head of a linked list, write a program in your language of choice to return the middle node of the list.   7 Answers"
        ],
        "date": "Feb 9, 2017"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Neutral Experience",
        "difficulty": "Average Interview",
        "length": "2+ months",
        "role": "Software Development Engineer",
        "details": "Had a referral sent in by a friend and had a phone screen with the manager (mostly questions about the team and my past experience, followed by a quick coding question). Followed by about a month of inactivity and then was brought in to an onsite with 4 people (3 engineers, 1 manager) and a lunch at the cafeteria. Each round involved talking about personal projects and experience, followed by a technical question and a demo of the team's product in several cases. Surprised by a 5th interviewer pop up at the end who seemed unaware of me and was on his phone and walked off in the middle to get tea. Maybe this was a test to see how I would respond? Was called a couple days later with a negotiable offer, only minor problems with difficulty getting hold of the recruiter.",
        "questions": [
            "Given 4 coins of values 1, 5, 10, and 20, find all the combinations of coins that can add up to K.   4 Answers",
            "Create a button menu using Javascript.   4 Answers",
            "Find ways to insert data collection in Javascript events.   4 Answers",
            "Given a linked list, put all the odd elements in lexicographical order list in front of the even elements in lexicographical order in place.   4 Answers",
            "Design chess using OOP.   2 Answers"
        ],
        "date": "Feb 2, 2017"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Negative Experience",
        "difficulty": "Difficult Interview",
        "length": "7+ weeks",
        "role": "Software Development Engineer",
        "details": "5 algorithmic questions got asked over and over different data structures and algorithm questions. It was difficult compared to modern hiring practices. Totally different once I joined the team. Worse thing is that the lunch interview is still an interview so watch out.",
        "questions": [
            "Mutex question   2 Answers"
        ],
        "date": "Jan 28, 2017"
    },
    {
        "gotOffer": "Accepted Offer",
        "experience": "Positive Experience",
        "difficulty": "Difficult Interview",
        "length": "3+ months",
        "role": "Software Development Engineer",
        "details": "First round - on campus 45 minutes coding round. Flew to Seattle. Total 4 rounds in person. Three coding rounds and one behavioral + previous work experience + projects + background. All coding rounds are whiteboard coding.",
        "questions": [
            "Questions on Tree and Array. A recursive and non-recursive solution for each.   2 Answers"
        ],
        "date": "Jan 30, 2017"
    }
]